app/controllers/timetracks_controller.rb

  def index
    @date = params[:date].nil? ? Date.today : params[:date].to_date
    @month = (@date.beginning_of_month..@date.end_of_month).to_a
    @timetracks = Timetrack.find_by_month(@date, current_user)
    @timetrack = current_user.timetracks.find_by_date(@date) || current_user.timetracks.new(date: @date, start: Time.now)
---
SELECT  "timetracks".* FROM "timetracks"  WHERE "timetracks"."user_id" = ? AND "timetracks"."date" = '2014-08-15' LIMIT 1  [["user_id", 1]]